RhinoInside.Revit API Documentation
GeometryEncoder.ToCurve Method (LineCurve)
 Converts the specified LineCurve to an equivalent Revit Curve.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8021
Syntax
public static Autodesk.Revit.DB.Curve ToCurve(
	this Rhino.Geometry.LineCurve value
)
@staticmethod
def ToCurve(
	value: Rhino.Geometry.LineCurve
) -> Autodesk.Revit.DB.Curve
Parameters
value
Type: Rhino.Geometry.LineCurve
A value to convert.
Return Value
Type: Autodesk.Revit.DB.Curve
A Revit Curve that is equivalent to the provided value.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Rhino.Geometry.LineCurve. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
GeometryEncoder Class
ToCurve Overload
RhinoInside.Revit.Convert.Geometry Namespace